## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth` |
| update | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`  |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:729164266357:log-group:/aws/lambda/sentinel-forwarder:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be updated in-place
  ~ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
        id        = "arn:aws:iam::729164266357:policy/SentinelForwarderLambda-sentinel-forwarder"
        name      = "SentinelForwarderLambda-sentinel-forwarder"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:729164266357:log-group:/aws/lambda/sentinel-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-forwarder"
      ~ last_modified                  = "2023-06-29T16:13:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:71",
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:125",
        ]
      ~ source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CUSTOMER_ID" = (sensitive value)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive value)
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "sentinel-forwarder-auth"
      + tags           = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all       = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.wordpress_ecs_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.wordpress_service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.wordpress_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_ecr_image"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_secret_value"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.wordpress_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_access_key_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_secret_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_list_manager_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.encryption_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.jwt_auth_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.list_manager_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
